dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/drivers/drv_ADCV1.c
/*
 * File      : drv_ADC.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2015, RT-Thread Development Team
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along
 *  with this program; if not, write to the Free Software Foundation, Inc.,
 *  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 *
 * Change Logs:
 * Date           Author       Notes
 * 2015-08-01     xiaonong     the first version for stm32f7xx
 */
#include <rtthread.h>
#ifdef USER_USING_MOTORLOWLEVEL
#ifdef USER_USING_MOTORBOARDV1
#include "MC_Lowlevel.h"
#include "stm32f7xx_MClib.h"
#include "MC_Globals.h"

//! \Add By Dl.K
#include "modules/hal/hal_obj.h"
#include "modules/MotorCtrlApp/MotorCtrlApp.h"
#define NB_CONVERSIONS 16
#define ADC_RIGHT_ALIGNMENT 4
//#define DATAALIGN_LEFT
#define DATAALIGN_RIGHT

/* Definition for USART1 clock resources */
#define ADC1_CLK_ENABLE()           __HAL_RCC_ADC1_CLK_ENABLE()
#define ADC2_CLK_ENABLE()           __HAL_RCC_ADC2_CLK_ENABLE()
#define ADC3_CLK_ENABLE()           __HAL_RCC_ADC3_CLK_ENABLE()
#define ADC_GPIOA_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
#define ADC_GPIOC_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
#define ADC_GPIOF_CLK_ENABLE()      __HAL_RCC_GPIOF_CLK_ENABLE()

#define ADC_FORCE_RESET()           __HAL_RCC_ADC_FORCE_RESET()
#define ADC_RELEASE_RESET()        	__HAL_RCC_ADC_RELEASE_RESET()

#define ADC_SR ((u32 *)(0x0 + ADC1_BASE))
#define JEOC1 (0x00000004)
#define JEOC2 (0x00000400)
#define JEOC3 (0x00040000)


#define PHASE_C1_CURRENT_CHANNEL     ADC_CHANNEL_6  	/*ADC1  IW*/
#define PHASE_C1_CURRENT_PIN         GPIO_PIN_6
#define PHASE_C1_CURRENT_PORT       	GPIOA

#define PHASE_B1_CURRENT_CHANNEL     ADC_CHANNEL_3	 /*ADC2  IV*/
#define PHASE_B1_CURRENT_PIN         GPIO_PIN_3
#define PHASE_B1_CURRENT_PORT       	GPIOA

#define PHASE_A1_CURRENT_CHANNEL     ADC_CHANNEL_5	 /*ADC3  IU*/
#define PHASE_A1_CURRENT_PIN         GPIO_PIN_7
#define PHASE_A1_CURRENT_PORT       	GPIOF


#define PHASE_C2_CURRENT_CHANNEL     ADC_CHANNEL_9  	/*ADC1  IW*/
#define PHASE_C2_CURRENT_PIN         GPIO_PIN_1
#define PHASE_C2_CURRENT_PORT       	GPIOB

#define PHASE_B2_CURRENT_CHANNEL     ADC_CHANNEL_12	 /*ADC2  IV*/
#define PHASE_B2_CURRENT_PIN         GPIO_PIN_2
#define PHASE_B2_CURRENT_PORT       	GPIOC

#define PHASE_A2_CURRENT_CHANNEL     ADC_CHANNEL_6	 /*ADC3  IU*/
#define PHASE_A2_CURRENT_PIN         GPIO_PIN_8
#define PHASE_A2_CURRENT_PORT       	GPIOF


#define PHASE_C_VOLTAGE_CHANNEL     ADC_CHANNEL_5 	/*ADC1 UW*/
#define PHASE_C_VOLTAGE_PIN         GPIO_PIN_5
#define PHASE_C_VOLTAGE_PORT       	GPIOA

#define PHASE_B_VOLTAGE_CHANNEL     ADC_CHANNEL_4/*ADC2 UV */
#define PHASE_B_VOLTAGE_PIN         GPIO_PIN_4
#define PHASE_B_VOLTAGE_PORT       	GPIOA

#define PHASE_A_VOLTAGE_CHANNEL     ADC_CHANNEL_7/*ADC3 UU */
#define PHASE_A_VOLTAGE_PIN         GPIO_PIN_9
#define PHASE_A_VOLTAGE_PORT       	GPIOF

		 	
#define PHASE_TEMP_CHANNEL     ADC_CHANNEL_8   /*ADC1 TEMP*/
#define PHASE_TEMP_PIN         GPIO_PIN_0
#define PHASE_TEMP_PORT       	GPIOB

#define PHASE_BUS_CURRENT_CHANNEL     ADC_CHANNEL_10/*ADC2 UD*/
#define PHASE_BUS_CURRENT_PIN         GPIO_PIN_0
#define PHASE_BUS_CURRENT_PORT       	GPIOC


#define PHASE_BUS_VOLTAGE_CHANNEL     ADC_CHANNEL_4/*ADC3 ID */
#define PHASE_BUS_VOLTAGE_PIN         GPIO_PIN_6
#define PHASE_BUS_VOLTAGE_PORT       	GPIOF


QIEMW_ADC_HandleTypeDef Global_User_ADC;


void QIEMW_ADC_init(QIEMW_ADC_HandleTypeDef *QIEMW_ADC_Handle)
{
	QIEMW_ADC_Handle->PhaseA.qI1_offset= 0;
	QIEMW_ADC_Handle->PhaseA.qI2_offset= 0;
	QIEMW_ADC_Handle->PhaseA.qV_offset= 0;
	QIEMW_ADC_Handle->PhaseB.qI1_offset = 0;
	QIEMW_ADC_Handle->PhaseB.qI2_offset = 0;
	QIEMW_ADC_Handle->PhaseB.qV_offset = 0;
	QIEMW_ADC_Handle->PhaseC.qI1_offset = 0;
	QIEMW_ADC_Handle->PhaseC.qI2_offset = 0;
	QIEMW_ADC_Handle->PhaseC.qV_offset = 0;
	QIEMW_ADC_Handle->BUS.qV_offset = 0;
	QIEMW_ADC_Handle->BUS.qI_offset = 0;
	QIEMW_ADC_Handle->UR.qV_offset = 0;
	QIEMW_ADC_Handle->US.qV_offset = 0;
	QIEMW_ADC_Handle->UT.qV_offset = 0;
	QIEMW_ADC_Handle->Temp.TEMP_offset = 0;
	

	QIEMW_ADC_Handle->PhaseA.qI_value = 0;
	QIEMW_ADC_Handle->PhaseA.qI1_value = 0;
	QIEMW_ADC_Handle->PhaseA.qI2_value = 0;
	QIEMW_ADC_Handle->PhaseA.qV_value = 0;
	QIEMW_ADC_Handle->PhaseB.qI_value = 0;
	QIEMW_ADC_Handle->PhaseB.qI1_value = 0;
	QIEMW_ADC_Handle->PhaseB.qI2_value = 0;
	QIEMW_ADC_Handle->PhaseB.qV_value = 0;
	QIEMW_ADC_Handle->PhaseC.qI1_value = 0;
	QIEMW_ADC_Handle->PhaseC.qI2_value = 0;
	QIEMW_ADC_Handle->PhaseC.qI_value = 0;
	QIEMW_ADC_Handle->PhaseC.qV_value = 0;
	QIEMW_ADC_Handle->BUS.qV_value = 0;
	QIEMW_ADC_Handle->BUS.qI_value = 0;
	QIEMW_ADC_Handle->UR.qV_value = 0;
	QIEMW_ADC_Handle->US.qV_value = 0;
	QIEMW_ADC_Handle->UT.qV_value = 0;
	QIEMW_ADC_Handle->Temp.TEMP_value = 0;
}

void ADC_Calibration(ADC_HandleTypeDef* hadc,QIEMW_ADC_HandleTypeDef *QIEMW_ADC_Handle)
{
	u8 bIndex;
	
	ADC_ChannelConfTypeDef sConfig;
	HAL_NVIC_DisableIRQ(ADC_IRQn);
	HAL_ADCEx_InjectedStop_IT(hadc);
	
	if(hadc->Instance == ADC1)
	{
		
		sConfig.Channel = PHASE_C1_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseC.qI1_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_C2_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseC.qI2_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_C_VOLTAGE_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseC.qV_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}

