dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/drivers/drv_ADCV1.c
		sConfig.Channel = PHASE_TEMP_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->Temp.TEMP_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
	}

	if(hadc->Instance == ADC2)
	{
		sConfig.Channel = PHASE_B1_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseB.qI1_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		HAL_ADC_Stop(hadc);
		
		sConfig.Channel = PHASE_B2_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);

		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			
			QIEMW_ADC_Handle->PhaseB.qI2_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_B_VOLTAGE_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);

		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			
			QIEMW_ADC_Handle->PhaseB.qV_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_BUS_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);

		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->BUS.qI_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
	}

	if(hadc->Instance == ADC3)
	{
		sConfig.Channel = PHASE_A1_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseA.qI1_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_A2_CURRENT_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseA.qI2_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_A_VOLTAGE_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->PhaseA.qV_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
		sConfig.Channel = PHASE_BUS_VOLTAGE_CHANNEL;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
		HAL_ADC_ConfigChannel(hadc, &sConfig);
		for(bIndex=NB_CONVERSIONS; bIndex != 0; bIndex--)
		{
			HAL_ADC_Start(hadc);
			while(!(__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC))) { }
			QIEMW_ADC_Handle->BUS.qV_offset += ((u16)HAL_ADC_GetValue(hadc)>>ADC_RIGHT_ALIGNMENT);
			
			__HAL_ADC_CLEAR_FLAG(hadc,ADC_FLAG_EOC);
		}
	}
}



void HAL_ADCEx_InjectedConvCpltCallback(ADC_HandleTypeDef* hadc)
{
	hadc->Instance = ADC1;
	Global_User_ADC.PhaseC.qI1_value = (s16)(HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_1));
	Global_User_ADC.PhaseC.qI2_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_2);
	Global_User_ADC.PhaseC.qV_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_3);
	Global_User_ADC.Temp.TEMP_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_4);
	hadc->Instance = ADC2;
	Global_User_ADC.PhaseB.qI1_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_1);
	Global_User_ADC.PhaseB.qI2_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_2);
	Global_User_ADC.PhaseB.qV_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_3);
	Global_User_ADC.BUS.qI_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_4);
	hadc->Instance = ADC3;
	Global_User_ADC.PhaseA.qI1_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_1);
	Global_User_ADC.PhaseA.qI2_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_2);
	Global_User_ADC.PhaseA.qV_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_3);
	Global_User_ADC.BUS.qV_value = (s16)HAL_ADCEx_InjectedGetValue(hadc, ADC_INJECTED_RANK_4);

	Global_User_ADC.PhaseC.qI_value = (s16)(((s32)Global_User_ADC.PhaseC.qI1_value + (s32)Global_User_ADC.PhaseC.qI2_value) >> 1);
	Global_User_ADC.PhaseB.qI_value = (s16)(((s32)Global_User_ADC.PhaseB.qI1_value + (s32)Global_User_ADC.PhaseB.qI2_value) >> 1);
	Global_User_ADC.PhaseA.qI_value = (s16)(((s32)Global_User_ADC.PhaseA.qI1_value + (s32)Global_User_ADC.PhaseA.qI2_value) >> 1);
	#ifdef RT_USING_STEMWIN
	ArrayDeal();
	#endif

//    if (SVPWMEOCEvent())
//    {
//      if ((State == START) || (State == RUN))
//      {
//        /**********STARTS THE VECTOR CONTROL ************************/    
//        IFOC_Model();
//      }
//  
//      #ifdef DAC_FUNCTIONALITY  
//        MCDAC_Update_Value(I_A,Stat_Curr_a_b.qI_Component1);
//        MCDAC_Update_Value(I_B,Stat_Curr_a_b.qI_Component2);
//        MCDAC_Update_Value(I_ALPHA,Stat_Curr_alfa_beta.qI_Component1);
//        MCDAC_Update_Value(I_BETA,Stat_Curr_alfa_beta.qI_Component2);
//        MCDAC_Update_Value(I_Q,Stat_Curr_q_d.qI_Component1);
//        MCDAC_Update_Value(I_D,Stat_Curr_q_d.qI_Component2);
//        MCDAC_Update_Value(I_Q_REF,hTorque_Reference);
//        MCDAC_Update_Value(I_D_REF,hFlux_Reference);
//        MCDAC_Update_Value(V_Q,Stat_Volt_q_d.qV_Component1);
//        MCDAC_Update_Value(V_D,Stat_Volt_q_d.qV_Component2);
//        MCDAC_Update_Value(V_ALPHA,Stat_Volt_alfa_beta.qV_Component1);
//        MCDAC_Update_Value(V_BETA,Stat_Volt_alfa_beta.qV_Component2); 
//        MCDAC_Update_Value(SENS_SPEED,((85*hRot_Freq_Hz)-S16_MAX));
//        #if (defined ENCODER)
//        MCDAC_Update_Value(SENS_ANGLE,ENC_Get_Electrical_Angle());
//        #elif (defined TACHO)
//        MCDAC_Update_Value(SENS_ANGLE,(s16) 0 );
//        #endif
//        
//        MCDAC_Update_Output();
//      #endif
//    }
	//__HAL_ADC_ENABLE_IT(hadc, ADC_IT_JEOC);
	
	//! \Add By Dl.K
	static HAL_AdcData_t sHal_AdcData;
	static HAL_PwmData_t sHal_PwmData;
	static HAL_QepData_t sHal_QepData;
	sHal_AdcData.I.value[0] = Global_User_ADC.PhaseA.qI_value;
	sHal_AdcData.I.value[1] = Global_User_ADC.PhaseB.qI_value;
	sHal_AdcData.I.value[2] = Global_User_ADC.PhaseC.qI_value;
	sHal_AdcData.IdcBus = Global_User_ADC.BUS.qI_value;
	sHal_AdcData.V.value[0] = Global_User_ADC.PhaseA.qV_value;
	sHal_AdcData.V.value[1] = Global_User_ADC.PhaseB.qV_value;
	sHal_AdcData.V.value[2] = Global_User_ADC.PhaseC.qV_value;
	sHal_AdcData.VdcBus = Global_User_ADC.BUS.qV_value;
	sHal_QepData.qep_cnt = (float_t)(4*4*ENCODER_PPR-1-GetCounterValue(TIM5))/(4.0f*ENCODER_PPR*4.0f);
	Motor_Ctrl_Run(&sHal_AdcData, &sHal_PwmData, &sHal_QepData);
	SetDutyCycles(TIM8, sHal_PwmData.Tabc.value[0]*(float)PWM_PERIOD, 
											sHal_PwmData.Tabc.value[1]*(float)PWM_PERIOD, 
											sHal_PwmData.Tabc.value[2]*(float)PWM_PERIOD);

