dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/drivers/drv_ADCV1.c
	#if 0
	static char i=0;
	i++;
	if(i>200)
	{
		i = 0;
		myprintf("123456789012\r\n", 15);
	}
	#endif
}
/*
void settestpin(void)
{

	HAL_GPIO_WritePin(GPIOI,GPIO_PIN_3, GPIO_PIN_SET);
}

void cleartestpin(void)
{
	HAL_GPIO_WritePin(GPIOI,GPIO_PIN_3, GPIO_PIN_RESET);
}
*/
void ADC_IRQHandler(void)
{
	ADC_HandleTypeDef ADC_handle;

    /* enter interrupt */
    rt_interrupt_enter();
	
	HAL_GPIO_WritePin(GPIOI,GPIO_PIN_3, GPIO_PIN_SET); /* idle 30usmax; online 40us max 20160822*/
	
	ADC_handle.Instance = ADC1;
	HAL_ADC_IRQHandler(&ADC_handle);
	
	HAL_GPIO_WritePin(GPIOI,GPIO_PIN_3, GPIO_PIN_RESET);
    /* leave interrupt */
    rt_interrupt_leave();
}
/**
  * @brief UART MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  *           - NVIC configuration for UART interrupt request enable
  * @param huart: UART handle pointer
  * @retval None
  */
	void HAL_ADC_MspInit(ADC_HandleTypeDef* hadc)
{
    GPIO_InitTypeDef  GPIO_InitStruct;
    if (hadc->Instance == ADC1)
    {
 		ADC1_CLK_ENABLE();
		ADC_GPIOA_CLK_ENABLE();
		ADC_GPIOC_CLK_ENABLE();

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_C1_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_C1_CURRENT_PORT, &GPIO_InitStruct);		

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_C2_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_C2_CURRENT_PORT, &GPIO_InitStruct);		
		
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_C_VOLTAGE_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_C_VOLTAGE_PORT, &GPIO_InitStruct);		
		
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_TEMP_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_TEMP_PORT, &GPIO_InitStruct);		
    }

	if (hadc->Instance == ADC2)
    {
 		ADC2_CLK_ENABLE();
		ADC_GPIOA_CLK_ENABLE();
		ADC_GPIOC_CLK_ENABLE();

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_B1_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_B1_CURRENT_PORT, &GPIO_InitStruct);		

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_B2_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_B2_CURRENT_PORT, &GPIO_InitStruct);		

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_B_VOLTAGE_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_B_VOLTAGE_PORT, &GPIO_InitStruct);	
		
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_BUS_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_BUS_CURRENT_PORT, &GPIO_InitStruct);		
    }

	
	if (hadc->Instance == ADC3)
    {
 		ADC3_CLK_ENABLE();
		ADC_GPIOA_CLK_ENABLE();
		ADC_GPIOF_CLK_ENABLE();

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_A1_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_A1_CURRENT_PORT, &GPIO_InitStruct);		

		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_A2_CURRENT_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_A2_CURRENT_PORT, &GPIO_InitStruct);		
		
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_A_VOLTAGE_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_A_VOLTAGE_PORT, &GPIO_InitStruct);		
		
		GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
		GPIO_InitStruct.Pin = PHASE_BUS_VOLTAGE_PIN;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(PHASE_BUS_VOLTAGE_PORT, &GPIO_InitStruct);		
    }

	/*************************test pin************************/
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pin = GPIO_PIN_3;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOI, &GPIO_InitStruct); 	
	
	HAL_NVIC_SetPriority(ADC_IRQn,ADC_IRQ_PREEMPT,ADC_IRQ_SUB);
	HAL_NVIC_EnableIRQ(ADC_IRQn);
}



extern void ADC_CalibrationAll(void)
{
	ADC_HandleTypeDef ADC1_handle,ADC2_handle,ADC3_handle;
	ADC_InjectionConfTypeDef ADCConfigInjected;
	ADC_MultiModeTypeDef ADCMultiMode;

	QIEMW_ADC_init(&Global_User_ADC);
	ADC1_handle.Instance = ADC1;
	ADC2_handle.Instance = ADC2;
	ADC3_handle.Instance = ADC3;
	#if 1
	ADC_Calibration(&ADC1_handle,&Global_User_ADC);
	ADC_Calibration(&ADC2_handle,&Global_User_ADC);
	ADC_Calibration(&ADC3_handle,&Global_User_ADC);
	#endif
	ADCConfigInjected.AutoInjectedConv = DISABLE;
	ADCConfigInjected.ExternalTrigInjecConv = ADC_EXTERNALTRIGINJECCONV_T8_TRGO2;
	ADCConfigInjected.ExternalTrigInjecConvEdge = ADC_EXTERNALTRIGINJECCONVEDGE_RISINGFALLING;
	ADCConfigInjected.InjectedChannel = PHASE_C1_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedDiscontinuousConvMode = DISABLE;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 1;
	ADCConfigInjected.InjectedSamplingTime = ADC_SAMPLETIME_28CYCLES;
	#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qI1_offset>>4;
	#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qI1_offset;
	ADCConfigInjected.InjectedOffset = 0;
	#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC1_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_C2_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 2;
	
	#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qI2_offset>>4;
	#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qI2_offset;
	ADCConfigInjected.InjectedOffset = 0;
	#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC1_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_C_VOLTAGE_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 3;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qV_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseC.qV_offset;
	ADCConfigInjected.InjectedOffset = 0;

#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC1_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_TEMP_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 4;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.Temp.TEMP_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.Temp.TEMP_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC1_handle,&ADCConfigInjected);
	
	
	ADCConfigInjected.ExternalTrigInjecConvEdge = ADC_EXTERNALTRIGINJECCONVEDGE_NONE;
	ADCConfigInjected.InjectedChannel = PHASE_B1_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 1;
	
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qI1_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qI1_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC2_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_B2_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 2;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qI2_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qI2_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC2_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_B_VOLTAGE_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 3;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qV_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseB.qV_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC2_handle,&ADCConfigInjected);
	
	ADCConfigInjected.InjectedChannel = PHASE_BUS_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 4;
	
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.BUS.qI_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.BUS.qI_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC2_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_A1_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 1;
	
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qI1_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qI1_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC3_handle,&ADCConfigInjected);

