dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/drivers/drv_ADCV1.c
	ADCConfigInjected.InjectedChannel = PHASE_A2_CURRENT_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 2;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qI2_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qI2_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC3_handle,&ADCConfigInjected);

	ADCConfigInjected.InjectedChannel = PHASE_A_VOLTAGE_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 3;
	
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qV_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.PhaseA.qV_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC3_handle,&ADCConfigInjected);
	
	ADCConfigInjected.InjectedChannel = PHASE_BUS_VOLTAGE_CHANNEL;
	ADCConfigInjected.InjectedNbrOfConversion = 4;
	ADCConfigInjected.InjectedRank = 4;
#ifdef DATAALIGN_LEFT
	ADCConfigInjected.InjectedOffset = Global_User_ADC.BUS.qV_offset>>4;
#else
	//ADCConfigInjected.InjectedOffset = Global_User_ADC.BUS.qV_offset;
	
	ADCConfigInjected.InjectedOffset = 0;
#endif
	HAL_ADCEx_InjectedConfigChannel(&ADC3_handle,&ADCConfigInjected);

	ADCMultiMode.DMAAccessMode = ADC_DMAACCESSMODE_DISABLED;
	ADCMultiMode.Mode = ADC_TRIPLEMODE_INJECSIMULT;
	ADCMultiMode.TwoSamplingDelay = ADC_TWOSAMPLINGDELAY_5CYCLES;
	HAL_ADCEx_MultiModeConfigChannel(&ADC1_handle, &ADCMultiMode);
	HAL_NVIC_EnableIRQ(ADC_IRQn);
	HAL_ADCEx_InjectedStart_IT(&ADC1_handle);
}

/**
  * @brief UART MSP De-Initialization
  *        This function frees the hardware resources used in this example:
  *          - Disable the Peripheral's clock
  *          - Revert GPIO and NVIC configuration to their default state
  * @param huart: UART handle pointer
  * @retval None
  */
	void HAL_ADC_MspDeInit(ADC_HandleTypeDef* hadc)
{
   
}

extern int stm32_hw_ADC_init(void)
{
	ADC_HandleTypeDef ADC1_handle,ADC2_handle,ADC3_handle;

	QIEMW_ADC_init(&Global_User_ADC);
	ADC1_handle.Instance = ADC1;
	HAL_ADC_DeInit(&ADC1_handle);
	ADC1_handle.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8; /* 96M/8 */
	ADC1_handle.Init.ContinuousConvMode = DISABLE;
	#ifdef DATAALIGN_LEFT
	ADC1_handle.Init.DataAlign = ADC_DATAALIGN_LEFT;
	#else
	ADC1_handle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
	#endif
	#if 1
	ADC1_handle.Init.DiscontinuousConvMode = DISABLE;
	ADC1_handle.Init.DMAContinuousRequests = DISABLE;
	ADC1_handle.Init.EOCSelection = ADC_EOC_SEQ_CONV;
	ADC1_handle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
	ADC1_handle.Init.NbrOfConversion = 1;
	ADC1_handle.Init.NbrOfDiscConversion = 0;
	#endif
	ADC1_handle.Init.Resolution = ADC_RESOLUTION_12B;
	ADC1_handle.Init.ScanConvMode = ENABLE;
	HAL_ADC_Init(&ADC1_handle);
	
	ADC2_handle.Instance = ADC2;
	HAL_ADC_DeInit(&ADC2_handle);

	
	ADC2_handle.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8; /* 96M/8 */
	ADC2_handle.Init.ContinuousConvMode = DISABLE;
	
#ifdef DATAALIGN_LEFT
	ADC2_handle.Init.DataAlign = ADC_DATAALIGN_LEFT;
#else
	ADC2_handle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
#endif
#if 1
	ADC2_handle.Init.DiscontinuousConvMode = DISABLE;
	ADC2_handle.Init.DMAContinuousRequests = DISABLE;
	ADC2_handle.Init.EOCSelection = ADC_EOC_SEQ_CONV;
	ADC2_handle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
	ADC2_handle.Init.NbrOfConversion = 1;
	ADC2_handle.Init.NbrOfDiscConversion = 0;
	#endif
	ADC2_handle.Init.Resolution = ADC_RESOLUTION_12B;
	ADC2_handle.Init.ScanConvMode = ENABLE;
	HAL_ADC_Init(&ADC2_handle);
	
	ADC3_handle.Instance = ADC3;
	HAL_ADC_DeInit(&ADC3_handle);
	ADC3_handle.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8; /* 96M/8 */
	ADC3_handle.Init.ContinuousConvMode = DISABLE;
	
#ifdef DATAALIGN_LEFT
	ADC3_handle.Init.DataAlign = ADC_DATAALIGN_LEFT;
#else
	ADC3_handle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
#endif
#if 1
	ADC3_handle.Init.DiscontinuousConvMode = DISABLE;
	ADC3_handle.Init.DMAContinuousRequests = DISABLE;
	ADC3_handle.Init.EOCSelection = ADC_EOC_SEQ_CONV;
	ADC3_handle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
	ADC3_handle.Init.NbrOfConversion = 1;
	ADC3_handle.Init.NbrOfDiscConversion = 0;
	#endif
	ADC3_handle.Init.Resolution = ADC_RESOLUTION_12B;
	ADC3_handle.Init.ScanConvMode = ENABLE;
	HAL_ADC_Init(&ADC3_handle);

	ADC_CalibrationAll();
	return 1;
}

#endif
#endif
/*---------------------------------------------end------------------------------------------*/
